# CanCategoryBeHidden Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..CanCategoryBeHidden Method
View Class See Also
---
Checks whether the category can be hidden in the view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool CanCategoryBeHidden(
	ElementId elementId
)
```

Visual Basic
---
```text
Public Function CanCategoryBeHidden ( _
	elementId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
bool CanCategoryBeHidden(
	ElementId^ elementId
)
```

# ### Parameters
elementId
    Type: Autodesk.Revit.DB..::..ElementId ElementId of the category.
# ### Return Value
True if the category can be hidden, false otherwise.
# Remarks
Categories can be allowed to be hidden in some view types and prohibited from being hidden in others. E.g., categories cannot be hidden in ProjectBrowser
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
View Class
Autodesk.Revit.DB Namespace